Autodesk.Revit.DB.ForgeDM.CloudHub.GetProjects
Gets all projects that are available to current login user from this Hub.
Remarks:
The empty projects or the projects which are associated with the current Revit version will be returned.
Returns:
The list of Projects. Returns an empty list if there is no project in this Hub
or the user doesn't have permission to access to the projects in this Hub.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be any reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud hub.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudHub.GetAllHubs
Gets all hubs (of the supported regions) that are available to current login user.
Returns:
The list of Hubs. Returns an empty list if the current user doesn't have any hub.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be any reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudHub.Region
Region of this Hub.
Please see the reference values, like Autodesk::Revit::DB::ModelPathUtils::CloudRegionUS
and Autodesk::Revit::DB::ModelPathUtils::CloudRegionEMEA,
and the new regions from release note.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudHub.Name
Name of this Hub.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudHub.Id
Identifier of this Hub.
Remarks:
Forge Hub id = "b." + BIM 360 Docs or Autodesk Docs Account id. For example, b.d12cb5fa-96cd-483b-8acb-46ef9a4b74d7
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudHub.#ctor(System.String,System.String,System.String)
Constructor for CloudHub.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudHub.#ctor(Autodesk.Revit.DB.ForgeDM.CloudHub)
For communication between Revit and Collaborate add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudHub
This class represents a Hub from ForgeDM.
Since:
2022